NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_umac.svd
              <field>
                <name>SEND_23</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[23].</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_24</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[24].</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_25</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[25].</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_26</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[26].</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_27</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[27].</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_28</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[28].</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_29</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[29].</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_30</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[30].</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_31</name>
                <description>The status for tasks overflow at SUBSCRIBE_SEND[31].</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow is happened.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow is not happened.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
