NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_umac.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_REGULATORS</name>
      <description>Voltage regulators</description>
      <baseAddress>0x50120000</baseAddress>
      <alternatePeripheral>GLOBAL_OSCILLATORS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>REGULATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRAMRECOVERY</name>
          <description>MRAM snapshot and recovery trigger register</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TAKESNAPSHOT</name>
              <description>Firmware sets this bit to request ROM to take an MRAM snapshot during the next boot.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>donothing</name>
                  <description>Do nothing (default).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>takesnapshot</name>
                  <description>Trigger snapshot generation on the next boot.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>success</name>
                  <description>Indicates successful snapshot generation on previous boot.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nomoresnapshots</name>
                  <description>Error during snapshot generation - there is no remaining space in FUSE array to secure another snapshot.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>Unspecified error during snapshot generation.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECOVERMRAM</name>
              <description>Firmware sets this bit to request ROM to recover from snapshot during the next boot.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>BOOTCOUNT</name>
              <description>Boot counter for MRAM recovery triggering in the presence of a boot loop. Firmware must clear this to zero on a successful boot.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>KEY</name>
              <description>Write key. KEY must be written to 0xB7A6 when writing MRAMRECOVERY register.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Write key value.</description>
                  <value>0xB7A6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_VREGUSB</name>
      <description>VREGUSB peripheral</description>
      <baseAddress>0x50121000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>VREGUSB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Enable and start VREGUSB so that it can detect VBUS</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Enable and start VREGUSB so that it can detect VBUS</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop and disable VREGUSB</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop and disable VREGUSB</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_VBUSDETECTED</name>
          <description>VBUS detected</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_VBUSDETECTED</name>
              <description>VBUS detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SETTLED3V3</name>
          <description>3V3 settled</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SETTLED3V3</name>
              <description>3V3 settled</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_VBUSREMOVED</name>
          <description>VBUS removed</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_VBUSREMOVED</name>
              <description>VBUS removed</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VBUSDETECTED</name>
              <description>Enable or disable interrupt for event VBUSDETECTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED3V3</name>
              <description>Enable or disable interrupt for event SETTLED3V3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSREMOVED</name>
              <description>Enable or disable interrupt for event VBUSREMOVED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VBUSDETECTED</name>
              <description>Write '1' to enable interrupt for event VBUSDETECTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED3V3</name>
              <description>Write '1' to enable interrupt for event SETTLED3V3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSREMOVED</name>
              <description>Write '1' to enable interrupt for event VBUSREMOVED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VBUSDETECTED</name>
              <description>Write '1' to disable interrupt for event VBUSDETECTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED3V3</name>
              <description>Write '1' to disable interrupt for event SETTLED3V3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSREMOVED</name>
              <description>Write '1' to disable interrupt for event VBUSREMOVED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VBUSDETECTED</name>
              <description>Read pending status of interrupt for event VBUSDETECTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETTLED3V3</name>
              <description>Read pending status of interrupt for event SETTLED3V3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSREMOVED</name>
              <description>Read pending status of interrupt for event VBUSREMOVED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
